bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY2313A.xml
            <value-group caption="" name="COMM_USART_MODE">
                <value caption="Asynchronous Operation" name="VAL_0x00" value="0x00"/>
                <value caption="Synchronous Operation" name="VAL_0x01" value="0x01"/>
                <value caption="Master SPI" name="VAL_0x03" value="0x03"/>
            </value-group>
            <value-group caption="" name="COMM_UPM_PARITY_MODE">
                <value caption="Disabled" name="VAL_0x00" value="0x00"/>
                <value caption="Reserved" name="VAL_0x01" value="0x01"/>
                <value caption="Enabled, Even Parity" name="VAL_0x02" value="0x02"/>
                <value caption="Enabled, Odd Parity" name="VAL_0x03" value="0x03"/>
            </value-group>
            <value-group caption="" name="COMM_STOP_BIT_SEL">
                <value caption="1-bit" name="VAL_0x00" value="0x00"/>
                <value caption="2-bit" name="VAL_0x01" value="0x01"/>
            </value-group>
        </module>
        <module caption="Analog Comparator" name="AC">
            <register-group caption="Analog Comparator" name="AC">
                <register caption="Analog Comparator Control And Status Register" name="ACSR" offset="0x28" size="1" ocd-rw="R">
                    <bitfield caption="Analog Comparator Disable" mask="0x80" name="ACD"/>
                    <bitfield caption="Analog Comparator Bandgap Select" mask="0x40" name="ACBG"/>
                    <bitfield caption="Analog Compare Output" mask="0x20" name="ACO"/>
                    <bitfield caption="Analog Comparator Interrupt Flag" mask="0x10" name="ACI"/>
                    <bitfield caption="Analog Comparator Interrupt Enable" mask="0x08" name="ACIE"/>
                    <bitfield caption="" mask="0x04" name="ACIC"/>
                    <bitfield caption="Analog Comparator Interrupt Mode Select bits" mask="0x03" name="ACIS" values="ANALOG_COMP_INTERRUPT"/>
                </register>
                <register caption="Digital Input Disable Register 1" name="DIDR" offset="0x21" size="1" mask="0x03"/>
            </register-group>
            <value-group caption="" name="ANALOG_COMP_INTERRUPT">
                <value caption="Interrupt on Toggle" name="VAL_0x00" value="0x00"/>
                <value caption="Reserved" name="VAL_0x01" value="0x01"/>
                <value caption="Interrupt on Falling Edge" name="VAL_0x02" value="0x02"/>
                <value caption="Interrupt on Rising Edge" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="EEPROM" name="EEPROM">
            <register-group caption="EEPROM" name="EEPROM">
                <register caption="EEPROM Read/Write Access" name="EEAR" offset="0x3E" size="1" mask="0x7F"/>
                <register caption="EEPROM Data Register" name="EEDR" offset="0x3D" size="1" mask="0xFF"/>
                <register caption="EEPROM Control Register" name="EECR" offset="0x3C" size="1">
                    <bitfield caption="" mask="0x30" name="EEPM" values="EEP_MODE"/>
                    <bitfield caption="EEProm Ready Interrupt Enable" mask="0x08" name="EERIE"/>
                    <bitfield caption="EEPROM Master Write Enable" mask="0x04" name="EEMPE"/>
                    <bitfield caption="EEPROM Write Enable" mask="0x02" name="EEPE"/>
                    <bitfield caption="EEPROM Read Enable" mask="0x01" name="EERE"/>
                </register>
            </register-group>
            <value-group caption="" name="EEP_MODE">
                <value caption="Erase and Write in one operation" name="VAL_0x00" value="0x00"/>
                <value caption="Erase Only" name="VAL_0x01" value="0x01"/>
                <value caption="Write Only" name="VAL_0x02" value="0x02"/>
            </value-group>
        </module>
        <module caption="Universal Serial Interface" name="USI">
            <register-group caption="Universal Serial Interface" name="USI">
                <register caption="USI Data Register" name="USIDR" offset="0x2F" size="1" mask="0xFF"/>
                <register caption="USI Status Register" name="USISR" offset="0x2E" size="1" ocd-rw="R">
                    <bitfield caption="Start Condition Interrupt Flag" mask="0x80" name="USISIF"/>
                    <bitfield caption="Counter Overflow Interrupt Flag" mask="0x40" name="USIOIF"/>
                    <bitfield caption="Stop Condition Flag" mask="0x20" name="USIPF"/>
                    <bitfield caption="Data Output Collision" mask="0x10" name="USIDC"/>
                    <bitfield caption="USI Counter Value Bits" mask="0x0F" name="USICNT"/>
                </register>
                <register caption="USI Control Register" name="USICR" offset="0x2D" size="1">
                    <bitfield caption="Start Condition Interrupt Enable" mask="0x80" name="USISIE"/>
                    <bitfield caption="Counter Overflow Interrupt Enable" mask="0x40" name="USIOIE"/>
                    <bitfield caption="USI Wire Mode Bits" mask="0x30" name="USIWM" values="COMM_USI_OP"/>
                    <bitfield caption="USI Clock Source Select Bits" mask="0x0C" name="USICS"/>
                    <bitfield caption="Clock Strobe" mask="0x02" name="USICLK"/>
                    <bitfield caption="Toggle Clock Port Pin" mask="0x01" name="USITC"/>
                </register>
            </register-group>
            <value-group caption="" name="COMM_USI_OP">
                <value caption="Normal Operation" name="VAL_0x00" value="0x00"/>
                <value caption="Three-Wire Mode" name="VAL_0x01" value="0x01"/>
                <value caption="Two-Wire Mode" name="VAL_0x02" value="0x02"/>
                <value caption="Two-Wire Mode Held Low" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="External Interrupts" name="EXINT">
            <register-group caption="External Interrupts" name="EXINT">
                <register caption="General Interrupt Mask Register" name="GIMSK" offset="0x5B" size="1">
                    <bitfield caption="External Interrupt Request 1 Enable" mask="0xC0" name="INT"/>
                    <bitfield caption="" mask="0x20" name="PCIE"/>
                </register>
                <register caption="General Interrupt Flag Register" name="GIFR" offset="0x5A" size="1" ocd-rw="R">
                    <bitfield caption="External Interrupt Flags" mask="0xC0" name="INTF"/>
                    <bitfield caption="Pin Change Interrupt Flags" mask="0x38" name="PCIF"/>
                </register>
                <register caption="Pin Change Interrupt Mask Register 2" name="PCMSK2" offset="0x25" size="1" ocd-rw="R">
                    <bitfield caption="Pin Change Interrupt Masks" mask="0x7F" name="PCINT" lsb="11"/>
                </register>
                <register caption="Pin Change Interrupt Mask Register 1" name="PCMSK1" offset="0x24" size="1" ocd-rw="R">
                    <bitfield caption="Pin Change Interrupt Masks" mask="0x07" name="PCINT" lsb="8"/>
                </register>
                <register caption="Pin Change Interrupt Mask Register 0" name="PCMSK0" offset="0x40" size="1" mask="0xFF"/>
            </register-group>
        </module>
        <module caption="CPU Registers" name="CPU">
            <register-group caption="CPU Registers" name="CPU">
                <register caption="Status Register" name="SREG" offset="0x5F" size="1">
                    <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
                    <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
                    <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
                    <bitfield caption="Sign Bit" mask="0x10" name="S"/>
                    <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
                    <bitfield caption="Negative Flag" mask="0x04" name="N"/>
                    <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
                    <bitfield caption="Carry Flag" mask="0x01" name="C"/>
                </register>
